CONSONNES_FR = ['ks', 'b', 'd', 'f', 'ɡ', 'k', 'l', 'm', 'n', 'ŋ', 'ɲ', 'p', 'ʁ', 's', 'ʃ', 't', 'v', 'z', 'ʒ']
VOYELLES_FR = ['ɑ̃', 'a', 'ɑ', 'e', 'ɛː', 'ɛ̃', 'ɛ', 'ə', 'i', 'œ̃', 'œ', 'ø', 'o', 'ɔ̃', 'ɔ', 'u', 'y', 'j', 'w', 'ɥ']

CONSONNES_IT = ['tʃ', 'dz', 'dʒ', 'ts', 'dʒː', 'dzː', 'tʃː', 'tsː', 'ŋɡ', 'ŋk', 'b', 'd', 'f', 'ɡ', 'ʎ', 'k', 'l', 'm', 'n', 'ɲ', 'p', 'r', 'ɾ', 's', 'ʃ', 't', 'v', 'z']
VOYELLES_IT = ['a', 'e', 'ɛ', 'i', 'ɪ', 'o', 'ɔ', 'u', 'ʊ', 'j','w']

CONSONNES_DE = ['tsj', 'pf', 'ts', 'tʃ', 'dʒ', 'b', 'd', 'ɡ', 'm', 'n', 'ŋ', 'p', 't', 'k', 'f', 'v' ,'θ', 's', 'ʃ', 'ç', 'x', 'z', 'ʒ', 'ʁ', 'r', 'ɾ', 'ɐ', 'h', 'l']
VOYELLES_DE = ['aː', 'aɪ', 'aʊ', 'a', 'ɛː', 'ɛ', 'eː', 'ə', 'ɪ', 'iː', 'ɔ', 'oː', 'œ', 'øː', 'ø', 'ʊ', 'uː', 'y', 'yː', 'j', 'ɑ̃', 'ɔ̃', 'ɑː']

CONSONNES_EN = ['tʃ', 'dʒ', 'p', 't', 'k', 'f', 'θ', 's', 'z', 'ʃ', 'h', 'b', 'd', 'ɡ', 'v', 'ʒ', 'ŋ', 'l', 'm', 'n', 'ɹ', 'ð']
VOYELLES_EN = ['iː', 'uː', 'ɜː', 'ɔː', 'ɑː', 'aʊ', 'eɪ', 'ɔɪ', 'əʊ', 'aɪ', 'ɪ', 'ʊ', 'ɛ', 'ɐ', 'a', 'ʌ', 'ɒ', 'ə', 'j', 'w']

CONSONNES_PT = ['ks', 'b', 'd','f', 'ɡ', 'k', 'l', 'ʎ', 'm', 'n', 'p', 'ɾ', 'ɹ', 'ʁ', 's', 't', 'v', 'z', 'ʃ', 'ʒ', 'ɲ']
VOYELLES_PT = ['weɪŋ', 'wɐ̃ŋ', 'ɐ̃ʊ̃', 'wa', 'aʊ', 'ua', 'ue', 'õj', 'eɪŋ', 'ɐ̃j', 'aɪ', 'oɪ', 'ɔɪ', 'iɔ', 'eɪ', 'oŋ', 'ɐ̃m', 'ɐ̃ŋ', 'ũm', 'ũŋ', 'eɪm', 'eɪŋ', 'iŋ', 'ə', 'ɐ', 'ɑ', 'ɐ̃', 'ũ', 'a', 'ɛ', 'e', 'ɨ', 'i', 'o', 'ɔ', 'ʊ', 'u']

CONSONNES_ES = ['b', 'tʃ', 'd', 'ð','f', 'ɡ', 'ɣ', 'x', 'θ', 'k', 'l', 'ʎ', 'm', 'n', 'ɲ', 'p', 'r', 'ɾ', 's', 't', 'β']
VOYELLES_ES = ['w', 'a', 'e', 'i', 'o', 'u', 'j', 'ɛ']
